ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_CTL0_DOUBLER_BYPASS_CTL_M \
                                0x40000000
#define OSC_DIG_CTL0_DOUBLER_BYPASS_CTL_S 30
#define OSC_DIG_CTL0_BYPASS_XOSC_LF_CLK_QUAL \
                                0x20000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_BYPASS_XOSC_LF_CLK_QUAL_M \
                                0x20000000
#define OSC_DIG_CTL0_BYPASS_XOSC_LF_CLK_QUAL_S 29
#define OSC_DIG_CTL0_BYPASS_RCOSC_LF_CLK_QUAL \
                                0x10000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_M \
                                0x10000000
#define OSC_DIG_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_S 28
#define OSC_DIG_CTL0_ACT_PWR_SAVING_EN \
                                0x00800000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_ACT_PWR_SAVING_EN_M \
                                0x00800000
#define OSC_DIG_CTL0_ACT_PWR_SAVING_EN_S 23
#define OSC_DIG_CTL0_FORCE_KICKSTART_EN \
                                0x00400000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_FORCE_KICKSTART_EN_M \
                                0x00400000
#define OSC_DIG_CTL0_FORCE_KICKSTART_EN_S 22
#define OSC_DIG_CTL0_BGAP_NEEDED_SW_CTL \
                                0x00200000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_BGAP_NEEDED_SW_CTL_M \
                                0x00200000
#define OSC_DIG_CTL0_BGAP_NEEDED_SW_CTL_S 21
#define OSC_DIG_CTL0_BGAP_NEEDED_SW_EN \
                                0x00100000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_BGAP_NEEDED_SW_EN_M \
                                0x00100000
#define OSC_DIG_CTL0_BGAP_NEEDED_SW_EN_S 20
#define OSC_DIG_CTL0_GBIAS_NEEDED_SW_CTL \
                                0x00080000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_GBIAS_NEEDED_SW_CTL_M \
                                0x00080000
#define OSC_DIG_CTL0_GBIAS_NEEDED_SW_CTL_S 19
#define OSC_DIG_CTL0_GBIAS_NEEDED_SW_EN \
                                0x00040000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_GBIAS_NEEDED_SW_EN_M \
                                0x00040000
#define OSC_DIG_CTL0_GBIAS_NEEDED_SW_EN_S 18
#define OSC_DIG_CTL0_AMPCOMP_REQ_IGNORES_GBIAS \
                                0x00020000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_AMPCOMP_REQ_IGNORES_GBIAS_M \
                                0x00020000
#define OSC_DIG_CTL0_AMPCOMP_REQ_IGNORES_GBIAS_S 17
#define OSC_DIG_CTL0_ALLOW_SCLK_HF_SWITCHING \
                                0x00010000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_ALLOW_SCLK_HF_SWITCHING_M \
                                0x00010000
#define OSC_DIG_CTL0_ALLOW_SCLK_HF_SWITCHING_S 16
#define OSC_DIG_CTL0_PD_PWR_SAVING_EN \
                                0x00008000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_PD_PWR_SAVING_EN_M \
                                0x00008000
#define OSC_DIG_CTL0_PD_PWR_SAVING_EN_S 15
#define OSC_DIG_CTL0_BAW_MODE_EN \
                                0x00004000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_BAW_MODE_EN_M \
                                0x00004000
#define OSC_DIG_CTL0_BAW_MODE_EN_S 14
#define OSC_DIG_CTL0_OSCDIG_BYP_CLK_SRC_IS_INT \
                                0x00002000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_OSCDIG_BYP_CLK_SRC_IS_INT_M \
                                0x00002000
#define OSC_DIG_CTL0_OSCDIG_BYP_CLK_SRC_IS_INT_S 13
#define OSC_DIG_CTL0_RCOSC_LF_TRIMMED \
                                0x00001000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

