ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_CTL0_RCOSC_LF_TRIMMED_M \
                                0x00001000
#define OSC_DIG_CTL0_RCOSC_LF_TRIMMED_S 12
#define OSC_DIG_CTL0_XOSC_HF_MODE \
                                0x00000800  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_XOSC_HF_MODE_M \
                                0x00000800
#define OSC_DIG_CTL0_XOSC_HF_MODE_S 11
#define OSC_DIG_CTL0_XOSC_LF_DIG_BYPASS \
                                0x00000400  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_XOSC_LF_DIG_BYPASS_M \
                                0x00000400
#define OSC_DIG_CTL0_XOSC_LF_DIG_BYPASS_S 10
#define OSC_DIG_CTL0_CLK_LOSS_EN \
                                0x00000200  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_CLK_LOSS_EN_M \
                                0x00000200
#define OSC_DIG_CTL0_CLK_LOSS_EN_S 9
#define OSC_DIG_CTL0_ACLK_TDC_SRC_SEL_M \
                                0x00000180  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_ACLK_TDC_SRC_SEL_S 7
#define OSC_DIG_CTL0_ACLK_REF_SRC_SEL_M \
                                0x00000060  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_ACLK_REF_SRC_SEL_S 5
#define OSC_DIG_CTL0_SCLK_LF_SRC_SEL_M \
                                0x0000000C  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_SCLK_LF_SRC_SEL_S 2
#define OSC_DIG_CTL0_SCLK_LF_SRC_SEL_RCOSCHFDLF \
                                0x00000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_CTL0_SCLK_LF_SRC_SEL_XOSCHFDLF \
                                0x00000004  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_CTL0_SCLK_LF_SRC_SEL_RCOSCLF \
                                0x00000008  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_CTL0_SCLK_LF_SRC_SEL_XOSCLF \
                                0x0000000C  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_CTL0_SCLK_MF_SRC_SEL \
                                0x00000002  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_SCLK_MF_SRC_SEL_M \
                                0x00000002
#define OSC_DIG_CTL0_SCLK_MF_SRC_SEL_S 1
#define OSC_DIG_CTL0_SCLK_MF_SRC_SEL_RCOSCHFDMF \
                                0x00000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_CTL0_SCLK_MF_SRC_SEL_XCOSCHFDMF \
                                0x00000002  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_CTL0_SCLK_HF_SRC_SEL \
                                0x00000001  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_CTL0_SCLK_HF_SRC_SEL_M \
                                0x00000001
#define OSC_DIG_CTL0_SCLK_HF_SRC_SEL_S 0
#define OSC_DIG_CTL0_SCLK_HF_SRC_SEL_RCOSC \
                                0x00000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_CTL0_SCLK_HF_SRC_SEL_XOSC \
                                0x00000001  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_RADCEXTCFG register.
//
//*****************************************************************************
#define OSC_DIG_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_M \
                                0xFFC00000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_S 22
#define OSC_DIG_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_M \
                                0x003F0000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_S 16
#define OSC_DIG_RADCEXTCFG_IDAC_STEP_M \
                                0x0000F000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_IDAC_STEP_S 12
#define OSC_DIG_RADCEXTCFG_RADC_DAC_TH_M \
                                0x00000FC0  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_RADC_DAC_TH_S 6
#define OSC_DIG_RADCEXTCFG_RADC_MODE_IS_SAR \
                                0x00000020  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

