ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_RADCEXTCFG_RADC_MODE_IS_SAR_M \
                                0x00000020
#define OSC_DIG_RADCEXTCFG_RADC_MODE_IS_SAR_S 5
#define OSC_DIG_RADCEXTCFG_RADC_START_CONV \
                                0x00000010  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_RADC_START_CONV_M \
                                0x00000010
#define OSC_DIG_RADCEXTCFG_RADC_START_CONV_S 4
#define OSC_DIG_RADCEXTCFG_DDI_RADC_CLK \
                                0x00000008  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_DDI_RADC_CLK_M \
                                0x00000008
#define OSC_DIG_RADCEXTCFG_DDI_RADC_CLK_S 3
#define OSC_DIG_RADCEXTCFG_RADC_USE_EXTERNAL_CLK \
                                0x00000004  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_RADC_USE_EXTERNAL_CLK_M \
                                0x00000004
#define OSC_DIG_RADCEXTCFG_RADC_USE_EXTERNAL_CLK_S 2
#define OSC_DIG_RADCEXTCFG_DDI_RADC_CLRZ \
                                0x00000002  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_DDI_RADC_CLRZ_M \
                                0x00000002
#define OSC_DIG_RADCEXTCFG_DDI_RADC_CLRZ_S 1
#define OSC_DIG_RADCEXTCFG_RADC_EXTERNAL_USE_EN \
                                0x00000001  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RADCEXTCFG_RADC_EXTERNAL_USE_EN_M \
                                0x00000001
#define OSC_DIG_RADCEXTCFG_RADC_EXTERNAL_USE_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_AMPCOMPCTL register.
//
//*****************************************************************************
#define OSC_DIG_AMPCOMPCTL_AMPCOMP_REQ_MODE \
                                0x40000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_AMPCOMP_REQ_MODE_M \
                                0x40000000
#define OSC_DIG_AMPCOMPCTL_AMPCOMP_REQ_MODE_S 30
#define OSC_DIG_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_M \
                                0x30000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_S 28
#define OSC_DIG_AMPCOMPCTL_AMPCOMP_SW_CTRL \
                                0x08000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_AMPCOMP_SW_CTRL_M \
                                0x08000000
#define OSC_DIG_AMPCOMPCTL_AMPCOMP_SW_CTRL_S 27
#define OSC_DIG_AMPCOMPCTL_AMPCOMP_SW_EN \
                                0x04000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_AMPCOMP_SW_EN_M \
                                0x04000000
#define OSC_DIG_AMPCOMPCTL_AMPCOMP_SW_EN_S 26
#define OSC_DIG_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_CTRL \
                                0x02000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_CTRL_M \
                                0x02000000
#define OSC_DIG_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_CTRL_S 25
#define OSC_DIG_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_EN \
                                0x01000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_EN_M \
                                0x01000000
#define OSC_DIG_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_EN_S 24
#define OSC_DIG_AMPCOMPCTL_IBIAS_OFFSET_M \
                                0x00F00000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

