ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_AMPCOMPCTL_IBIAS_OFFSET_S 20
#define OSC_DIG_AMPCOMPCTL_IBIAS_INIT_M \
                                0x000F0000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_IBIAS_INIT_S 16
#define OSC_DIG_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_M \
                                0x0000FF00  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_S 8
#define OSC_DIG_AMPCOMPCTL_CAP_STEP_M \
                                0x000000F0  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_CAP_STEP_S 4
#define OSC_DIG_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_M \
                                0x0000000F  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_AMPCOMPTH1 register.
//
//*****************************************************************************
#define OSC_DIG_AMPCOMPTH1_HPMRAMP2_TH_M \
                                0xFC000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH1_HPMRAMP2_TH_S 26
#define OSC_DIG_AMPCOMPTH1_HPMRAMP3_LTH_M \
                                0x00FC0000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH1_HPMRAMP3_LTH_S 18
#define OSC_DIG_AMPCOMPTH1_HPMRAMP3_HTH_M \
                                0x0000FC00  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH1_HPMRAMP3_HTH_S 10
#define OSC_DIG_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_M \
                                0x000003C0  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_S 6
#define OSC_DIG_AMPCOMPTH1_HPMRAMP1_TH_M \
                                0x0000003F  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH1_HPMRAMP1_TH_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_AMPCOMPTH2 register.
//
//*****************************************************************************
#define OSC_DIG_AMPCOMPTH2_LPMUPDATE_LTH_M \
                                0xFC000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH2_LPMUPDATE_LTH_S 26
#define OSC_DIG_AMPCOMPTH2_LPMUPDATE_HTH_M \
                                0x00FC0000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH2_LPMUPDATE_HTH_S 18
#define OSC_DIG_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_M \
                                0x0000FC00  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_S 10
#define OSC_DIG_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_M \
                                0x000000FC  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_S 2
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_ANABYPASSVAL1 register.
//
//*****************************************************************************
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_LP_BUF_EN \
                                0x80000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_LP_BUF_EN_M \
                                0x80000000
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_LP_BUF_EN_S 31
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_HP_BUF_EN \
                                0x40000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

