ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_HP_BUF_EN_M \
                                0x40000000
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_HP_BUF_EN_S 30
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_PEAK_DET_EN \
                                0x20000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_PEAK_DET_EN_M \
                                0x20000000
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_PEAK_DET_EN_S 29
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_MUX_SEL \
                                0x10000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_MUX_SEL_M \
                                0x10000000
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_MUX_SEL_S 28
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_EN \
                                0x08000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_EN_M \
                                0x08000000
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_EN_S 27
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_IDAC_M \
                                0x07F00000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_IDAC_S 20
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_ROW_Q12_M \
                                0x000F0000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_ROW_Q12_S 16
#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_M \
                                0x0000FFFF  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_ANABYPASSVAL2 register.
//
//*****************************************************************************
#define OSC_DIG_ANABYPASSVAL2_RCOSC_LF_EN \
                                0x80000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL2_RCOSC_LF_EN_M \
                                0x80000000
#define OSC_DIG_ANABYPASSVAL2_RCOSC_LF_EN_S 31
#define OSC_DIG_ANABYPASSVAL2_XOSC_LF_EN \
                                0x40000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL2_XOSC_LF_EN_M \
                                0x40000000
#define OSC_DIG_ANABYPASSVAL2_XOSC_LF_EN_S 30
#define OSC_DIG_ANABYPASSVAL2_DOUBLER_EN \
                                0x20000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL2_DOUBLER_EN_M \
                                0x20000000
#define OSC_DIG_ANABYPASSVAL2_DOUBLER_EN_S 29
#define OSC_DIG_ANABYPASSVAL2_GBIAS_NEEDED \
                                0x10000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL2_GBIAS_NEEDED_M \
                                0x10000000
#define OSC_DIG_ANABYPASSVAL2_GBIAS_NEEDED_S 28
#define OSC_DIG_ANABYPASSVAL2_BGAP_NEEDED \
                                0x08000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL2_BGAP_NEEDED_M \
                                0x08000000
#define OSC_DIG_ANABYPASSVAL2_BGAP_NEEDED_S 27
#define OSC_DIG_ANABYPASSVAL2_ADC_ANA_EN \
                                0x04000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ANABYPASSVAL2_ADC_ANA_EN_M \
                                0x04000000
#define OSC_DIG_ANABYPASSVAL2_ADC_ANA_EN_S 26
#define OSC_DIG_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_M \
                                0x00003FFF  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

