ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_ADCDOUBLERNANOAMPCTL register.
//
//*****************************************************************************
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_TESTHIGH_I_EN \
                                0x80000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_TESTHIGH_I_EN_M \
                                0x80000000
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_TESTHIGH_I_EN_S 31
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_RES_TRIM_M \
                                0x7E000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_RES_TRIM_S 25
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE \
                                0x01000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE_M \
                                0x01000000
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE_S 24
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_SPARE23 \
                                0x00800000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_SPARE23_M \
                                0x00800000
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_SPARE23_S 23
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_SELECT \
                                0x00400000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_SELECT_M \
                                0x00400000
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_SELECT_S 22
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_ENABLE \
                                0x00200000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_ENABLE_M \
                                0x00200000
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_ENABLE_S 21
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_CAP_M \
                                0x00180000  // Loop filter cap 00: Nominal 01: 
                                            // Decrement 17%; 10: Increment 
                                            // 34%; 11: Increment 17% 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_CAP_S 19
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_RESET_VOLTAGE_M \
                                0x00060000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_RESET_VOLTAGE_S 17
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DOUBLER_EN_BIAS_ONLY \
                                0x00010000  // Enable and consume bias 
                                            // currents but does not turn the 
                                            // doubler on. 0: Disabled 1: 
                                            // Enabled Used if there is 
                                            // sensitivity to kickback on 
                                            // global bias blocks. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DOUBLER_EN_BIAS_ONLY_M \
                                0x00010000
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_DOUBLER_EN_BIAS_ONLY_S 16
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_IPTAT_IREF_OR \
                                0x00000200  // Override IPTAT and IREF 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_IPTAT_IREF_OR_M \
                                0x00000200
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_IPTAT_IREF_OR_S 9
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_ATEST_SRC_M \
                                0x00000180  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_ATEST_SRC_S 7
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_EN_ATEST \
                                0x00000040  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_EN_ATEST_M \
                                0x00000040
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_EN_ATEST_S 6
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN \
                                0x00000020  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN_M \
                                0x00000020
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN_S 5
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN \
                                0x00000010  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

