ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN_M \
                                0x00000010
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN_S 4
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_MUX_SEL_M \
                                0x0000000C  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_MUX_SEL_S 2
#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_M \
                                0x00000003  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_XOSCHFCTL register.
//
//*****************************************************************************
#define OSC_DIG_XOSCHFCTL_XOSCHF_HPBUFF_IREF_OVERRIDE \
                                0x00000800  // Enable dummy bias mode. 0: 
                                            // Normal mode, 1: Dummy bias mode 

#define OSC_DIG_XOSCHFCTL_XOSCHF_HPBUFF_IREF_OVERRIDE_M \
                                0x00000800
#define OSC_DIG_XOSCHFCTL_XOSCHF_HPBUFF_IREF_OVERRIDE_S 11
#define OSC_DIG_XOSCHFCTL_XOSCHF_PEAKDET_IPTAT_OVERRIDE \
                                0x00000400  // Enable dummy bias mode. 0: 
                                            // Normal mode, 1: Dummy bias mode 

#define OSC_DIG_XOSCHFCTL_XOSCHF_PEAKDET_IPTAT_OVERRIDE_M \
                                0x00000400
#define OSC_DIG_XOSCHFCTL_XOSCHF_PEAKDET_IPTAT_OVERRIDE_S 10
#define OSC_DIG_XOSCHFCTL_PEAK_DET_ITRIM_M \
                                0x00000300  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_XOSCHFCTL_PEAK_DET_ITRIM_S 8
#define OSC_DIG_XOSCHFCTL_HP_ALT_BIAS \
                                0x00000080  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_XOSCHFCTL_HP_ALT_BIAS_M \
                                0x00000080
#define OSC_DIG_XOSCHFCTL_HP_ALT_BIAS_S 7
#define OSC_DIG_XOSCHFCTL_BYPASS \
                                0x00000040  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_XOSCHFCTL_BYPASS_M \
                                0x00000040
#define OSC_DIG_XOSCHFCTL_BYPASS_S 6
#define OSC_DIG_XOSCHFCTL_TESTMUX_EN \
                                0x00000020  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_XOSCHFCTL_TESTMUX_EN_M \
                                0x00000020
#define OSC_DIG_XOSCHFCTL_TESTMUX_EN_S 5
#define OSC_DIG_XOSCHFCTL_HP_BUF_ITRIM_M \
                                0x0000001C  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_XOSCHFCTL_HP_BUF_ITRIM_S 2
#define OSC_DIG_XOSCHFCTL_LP_BUF_ITRIM_M \
                                0x00000003  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_XOSCHFCTL_LP_BUF_ITRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_LFOSCCTL register.
//
//*****************************************************************************
#define OSC_DIG_LFOSCCTL_XOSCLF_BUFFER_TRIM \
                                0x04000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_XOSCLF_BUFFER_TRIM_M \
                                0x04000000
#define OSC_DIG_LFOSCCTL_XOSCLF_BUFFER_TRIM_S 26
#define OSC_DIG_LFOSCCTL_XOSCLF_TESTMUX_EN \
                                0x02000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_XOSCLF_TESTMUX_EN_M \
                                0x02000000
#define OSC_DIG_LFOSCCTL_XOSCLF_TESTMUX_EN_S 25
#define OSC_DIG_LFOSCCTL_XOSCLF_AMP_BOOST \
                                0x01000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

