ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_LFOSCCTL_XOSCLF_AMP_BOOST_M \
                                0x01000000
#define OSC_DIG_LFOSCCTL_XOSCLF_AMP_BOOST_S 24
#define OSC_DIG_LFOSCCTL_XOSCLF_REGULATOR_TRIM_M \
                                0x00C00000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_XOSCLF_REGULATOR_TRIM_S 22
#define OSC_DIG_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_M \
                                0x003C0000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_S 18
#define OSC_DIG_LFOSCCTL_XOSCLF_ANA_AMP_CTRL \
                                0x00020000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_XOSCLF_ANA_AMP_CTRL_M \
                                0x00020000
#define OSC_DIG_LFOSCCTL_XOSCLF_ANA_AMP_CTRL_S 17
#define OSC_DIG_LFOSCCTL_XOSCLF_RXTX_MODE \
                                0x00010000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_XOSCLF_RXTX_MODE_M \
                                0x00010000
#define OSC_DIG_LFOSCCTL_XOSCLF_RXTX_MODE_S 16
#define OSC_DIG_LFOSCCTL_RCOSCLF_VDD_LOCAL_TRIM \
                                0x00000800  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_RCOSCLF_VDD_LOCAL_TRIM_M \
                                0x00000800
#define OSC_DIG_LFOSCCTL_RCOSCLF_VDD_LOCAL_TRIM_S 11
#define OSC_DIG_LFOSCCTL_RCOSCLF_LOCAL_ATEST_EN \
                                0x00000400  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_RCOSCLF_LOCAL_ATEST_EN_M \
                                0x00000400
#define OSC_DIG_LFOSCCTL_RCOSCLF_LOCAL_ATEST_EN_S 10
#define OSC_DIG_LFOSCCTL_RCOSCLF_RTUNE_TRIM_M \
                                0x00000300  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_RCOSCLF_RTUNE_TRIM_S 8
#define OSC_DIG_LFOSCCTL_RCOSCLF_RTUNE_TRIM_7P5MEG \
                                0x00000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_LFOSCCTL_RCOSCLF_RTUNE_TRIM_7P0MEG \
                                0x00000100  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_LFOSCCTL_RCOSCLF_RTUNE_TRIM_6P5MEG \
                                0x00000200  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_LFOSCCTL_RCOSCLF_RTUNE_TRIM_6P0MEG \
                                0x00000300  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_LFOSCCTL_RCOSCLF_CTUNE_TRIM_M \
                                0x000000FF  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_LFOSCCTL_RCOSCLF_CTUNE_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_RCOSCHFCTL register.
//
//*****************************************************************************
#define OSC_DIG_RCOSCHFCTL_RCOSCHF_CTRIM_M \
                                0x0000FF00  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RCOSCHFCTL_RCOSCHF_CTRIM_S 8
#define OSC_DIG_RCOSCHFCTL_SPARE6_M \
                                0x000000C0  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RCOSCHFCTL_SPARE6_S 6
#define OSC_DIG_RCOSCHFCTL_RCOSCHF_ATEST_EN \
                                0x00000020  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RCOSCHFCTL_RCOSCHF_ATEST_EN_M \
                                0x00000020
#define OSC_DIG_RCOSCHFCTL_RCOSCHF_ATEST_EN_S 5
#define OSC_DIG_RCOSCHFCTL_RCOSCHF_BYPASS_GATE \
                                0x00000010  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

