ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_RCOSCHFCTL_RCOSCHF_BYPASS_GATE_M \
                                0x00000010
#define OSC_DIG_RCOSCHFCTL_RCOSCHF_BYPASS_GATE_S 4
#define OSC_DIG_RCOSCHFCTL_RCOSCHF_ITUNE_TRIM_M \
                                0x0000000F  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_RCOSCHFCTL_RCOSCHF_ITUNE_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_STAT0 register.
//
//*****************************************************************************
#define OSC_DIG_STAT0_SCLK_LF_SRC_M \
                                0x60000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_SCLK_LF_SRC_S 29
#define OSC_DIG_STAT0_SCLK_HF_SRC \
                                0x10000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_SCLK_HF_SRC_M \
                                0x10000000
#define OSC_DIG_STAT0_SCLK_HF_SRC_S 28
#define OSC_DIG_STAT0_BYPASS_OSCDIG \
                                0x08000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_BYPASS_OSCDIG_M \
                                0x08000000
#define OSC_DIG_STAT0_BYPASS_OSCDIG_S 27
#define OSC_DIG_STAT0_BGAP_NEEDED \
                                0x04000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_BGAP_NEEDED_M \
                                0x04000000
#define OSC_DIG_STAT0_BGAP_NEEDED_S 26
#define OSC_DIG_STAT0_BGAP_RDY  0x02000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT0_BGAP_RDY_M \
                                0x02000000
#define OSC_DIG_STAT0_BGAP_RDY_S 25
#define OSC_DIG_STAT0_GBIAS_NEEDED \
                                0x01000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_GBIAS_NEEDED_M \
                                0x01000000
#define OSC_DIG_STAT0_GBIAS_NEEDED_S 24
#define OSC_DIG_STAT0_GBIAS_RDY 0x00800000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT0_GBIAS_RDY_M \
                                0x00800000
#define OSC_DIG_STAT0_GBIAS_RDY_S 23
#define OSC_DIG_STAT0_RCOSC_HF_EN \
                                0x00400000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_RCOSC_HF_EN_M \
                                0x00400000
#define OSC_DIG_STAT0_RCOSC_HF_EN_S 22
#define OSC_DIG_STAT0_RCOSC_LF_EN \
                                0x00200000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_RCOSC_LF_EN_M \
                                0x00200000
#define OSC_DIG_STAT0_RCOSC_LF_EN_S 21
#define OSC_DIG_STAT0_XOSC_LF_EN \
                                0x00100000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_XOSC_LF_EN_M \
                                0x00100000
#define OSC_DIG_STAT0_XOSC_LF_EN_S 20
#define OSC_DIG_STAT0_CLK_DCDC_RDY \
                                0x00080000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_CLK_DCDC_RDY_M \
                                0x00080000
#define OSC_DIG_STAT0_CLK_DCDC_RDY_S 19
#define OSC_DIG_STAT0_CLK_DCDC_RDY_ACK \
                                0x00040000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_CLK_DCDC_RDY_ACK_M \
                                0x00040000
#define OSC_DIG_STAT0_CLK_DCDC_RDY_ACK_S 18
#define OSC_DIG_STAT0_SCLK_HF_LOSS \
                                0x00020000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_SCLK_HF_LOSS_M \
                                0x00020000
#define OSC_DIG_STAT0_SCLK_HF_LOSS_S 17
#define OSC_DIG_STAT0_SCLK_LF_LOSS \
                                0x00010000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_SCLK_LF_LOSS_M \
                                0x00010000
#define OSC_DIG_STAT0_SCLK_LF_LOSS_S 16
#define OSC_DIG_STAT0_XOSC_HF_EN \
                                0x00008000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

