ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_STAT0_XOSC_HF_EN_M \
                                0x00008000
#define OSC_DIG_STAT0_XOSC_HF_EN_S 15
#define OSC_DIG_STAT0_XOSC_HF_PEAK_DET_EN \
                                0x00004000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_XOSC_HF_PEAK_DET_EN_M \
                                0x00004000
#define OSC_DIG_STAT0_XOSC_HF_PEAK_DET_EN_S 14
#define OSC_DIG_STAT0_DOUBLER_EN \
                                0x00002000  // DOUBLER_EN 

#define OSC_DIG_STAT0_DOUBLER_EN_M \
                                0x00002000
#define OSC_DIG_STAT0_DOUBLER_EN_S 13
#define OSC_DIG_STAT0_ADC_EN    0x00001000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT0_ADC_EN_M  0x00001000
#define OSC_DIG_STAT0_ADC_EN_S  12
#define OSC_DIG_STAT0_XOSC_HF_LP_BUF_EN \
                                0x00000800  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_XOSC_HF_LP_BUF_EN_M \
                                0x00000800
#define OSC_DIG_STAT0_XOSC_HF_LP_BUF_EN_S 11
#define OSC_DIG_STAT0_XOSC_HF_HP_BUF_EN \
                                0x00000400  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_XOSC_HF_HP_BUF_EN_M \
                                0x00000400
#define OSC_DIG_STAT0_XOSC_HF_HP_BUF_EN_S 10
#define OSC_DIG_STAT0_RADC_DIG_CLRZ \
                                0x00000200  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_RADC_DIG_CLRZ_M \
                                0x00000200
#define OSC_DIG_STAT0_RADC_DIG_CLRZ_S 9
#define OSC_DIG_STAT0_ADC_THMET 0x00000100  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT0_ADC_THMET_M \
                                0x00000100
#define OSC_DIG_STAT0_ADC_THMET_S 8
#define OSC_DIG_STAT0_ADC_DATA_READY \
                                0x00000080  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_ADC_DATA_READY_M \
                                0x00000080
#define OSC_DIG_STAT0_ADC_DATA_READY_S 7
#define OSC_DIG_STAT0_ADC_DATA_M \
                                0x0000007E  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_ADC_DATA_S 1
#define OSC_DIG_STAT0_PENDINGSCLKHFSWITCHING \
                                0x00000001  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT0_PENDINGSCLKHFSWITCHING_M \
                                0x00000001
#define OSC_DIG_STAT0_PENDINGSCLKHFSWITCHING_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_STAT1 register.
//
//*****************************************************************************
#define OSC_DIG_STAT1_RAMPSTATE_M \
                                0xF0000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_RAMPSTATE_S 28
#define OSC_DIG_STAT1_RAMPSTATE_RESET \
                                0x00000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_INITIALIZATION \
                                0x10000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_HPM_RAMP1 \
                                0x20000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_HPM_RAMP2 \
                                0x30000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_HPM_RAMP3 \
                                0x40000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_HPM_UPDATE \
                                0x50000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_IDAC_INCREMENT \
                                0x60000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_IBIAS_CAP_UPDATE \
                                0x70000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_IBIAS_DEC_W_MEASURE \
                                0x80000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_LPM_UPDATE \
                                0x90000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_IBIAS_INC \
                                0xA0000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_IDAC_DEC_W_MEASURE \
                                0xB0000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_DUMMY_TO_INIT_1 \
                                0xC0000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_FAST_START \
                                0xD0000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_RAMPSTATE_FAST_START_SETTLE \
                                0xE0000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT1_HMP_UPDATE_AMP_M \
                                0x0FC00000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_HMP_UPDATE_AMP_S 22
#define OSC_DIG_STAT1_LPM_UPDATE_AMP_M \
                                0x003F0000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_LPM_UPDATE_AMP_S 16
#define OSC_DIG_STAT1_FORCE_RCOSC_HF \
                                0x00008000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

