ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_STAT1_FORCE_RCOSC_HF_M \
                                0x00008000
#define OSC_DIG_STAT1_FORCE_RCOSC_HF_S 15
#define OSC_DIG_STAT1_SCLK_HF_EN \
                                0x00004000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_SCLK_HF_EN_M \
                                0x00004000
#define OSC_DIG_STAT1_SCLK_HF_EN_S 14
#define OSC_DIG_STAT1_SCLK_MF_EN \
                                0x00002000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_SCLK_MF_EN_M \
                                0x00002000
#define OSC_DIG_STAT1_SCLK_MF_EN_S 13
#define OSC_DIG_STAT1_ACLK_ADC_EN \
                                0x00001000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_ACLK_ADC_EN_M \
                                0x00001000
#define OSC_DIG_STAT1_ACLK_ADC_EN_S 12
#define OSC_DIG_STAT1_ACLK_TDC_EN \
                                0x00000800  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_ACLK_TDC_EN_M \
                                0x00000800
#define OSC_DIG_STAT1_ACLK_TDC_EN_S 11
#define OSC_DIG_STAT1_ACLK_REF_EN \
                                0x00000400  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_ACLK_REF_EN_M \
                                0x00000400
#define OSC_DIG_STAT1_ACLK_REF_EN_S 10
#define OSC_DIG_STAT1_CLK_CHP_EN \
                                0x00000200  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_CLK_CHP_EN_M \
                                0x00000200
#define OSC_DIG_STAT1_CLK_CHP_EN_S 9
#define OSC_DIG_STAT1_CLK_DCDC_EN \
                                0x00000100  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_CLK_DCDC_EN_M \
                                0x00000100
#define OSC_DIG_STAT1_CLK_DCDC_EN_S 8
#define OSC_DIG_STAT1_SCLK_HF_GOOD \
                                0x00000080  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_SCLK_HF_GOOD_M \
                                0x00000080
#define OSC_DIG_STAT1_SCLK_HF_GOOD_S 7
#define OSC_DIG_STAT1_SCLK_MF_GOOD \
                                0x00000040  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_SCLK_MF_GOOD_M \
                                0x00000040
#define OSC_DIG_STAT1_SCLK_MF_GOOD_S 6
#define OSC_DIG_STAT1_SCLK_LF_GOOD \
                                0x00000020  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_SCLK_LF_GOOD_M \
                                0x00000020
#define OSC_DIG_STAT1_SCLK_LF_GOOD_S 5
#define OSC_DIG_STAT1_ACLK_ADC_GOOD \
                                0x00000010  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_ACLK_ADC_GOOD_M \
                                0x00000010
#define OSC_DIG_STAT1_ACLK_ADC_GOOD_S 4
#define OSC_DIG_STAT1_ACLK_TDC_GOOD \
                                0x00000008  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_ACLK_TDC_GOOD_M \
                                0x00000008
#define OSC_DIG_STAT1_ACLK_TDC_GOOD_S 3
#define OSC_DIG_STAT1_ACLK_REF_GOOD \
                                0x00000004  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_ACLK_REF_GOOD_M \
                                0x00000004
#define OSC_DIG_STAT1_ACLK_REF_GOOD_S 2
#define OSC_DIG_STAT1_CLK_CHP_GOOD \
                                0x00000002  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_CLK_CHP_GOOD_M \
                                0x00000002
#define OSC_DIG_STAT1_CLK_CHP_GOOD_S 1
#define OSC_DIG_STAT1_CLK_DCDC_GOOD \
                                0x00000001  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT1_CLK_DCDC_GOOD_M \
                                0x00000001
#define OSC_DIG_STAT1_CLK_DCDC_GOOD_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// OSC_DIG_O_STAT2 register.
//
//*****************************************************************************
#define OSC_DIG_STAT2_ADC_DCBIAS_M \
                                0xFC000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_ADC_DCBIAS_S 26
#define OSC_DIG_STAT2_HPM_RAMP1_THMEHT \
                                0x02000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_HPM_RAMP1_THMEHT_M \
                                0x02000000
#define OSC_DIG_STAT2_HPM_RAMP1_THMEHT_S 25
#define OSC_DIG_STAT2_HPM_RAMP2_THMET \
                                0x01000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_HPM_RAMP2_THMET_M \
                                0x01000000
#define OSC_DIG_STAT2_HPM_RAMP2_THMET_S 24
#define OSC_DIG_STAT2_HPM_RAMP3_THMET \
                                0x00800000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_HPM_RAMP3_THMET_M \
                                0x00800000
#define OSC_DIG_STAT2_HPM_RAMP3_THMET_S 23
#define OSC_DIG_STAT2_IBIAS_DEC_WITH_MEASURE_DONE \
                                0x00400000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

