ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_STAT2_IBIAS_DEC_WITH_MEASURE_DONE_M \
                                0x00400000
#define OSC_DIG_STAT2_IBIAS_DEC_WITH_MEASURE_DONE_S 22
#define OSC_DIG_STAT2_IBIAS_WAIT_CNTR_DONE \
                                0x00200000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_IBIAS_WAIT_CNTR_DONE_M \
                                0x00200000
#define OSC_DIG_STAT2_IBIAS_WAIT_CNTR_DONE_S 21
#define OSC_DIG_STAT2_IDAC_INCREMENT_DONE \
                                0x00100000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_IDAC_INCREMENT_DONE_M \
                                0x00100000
#define OSC_DIG_STAT2_IDAC_INCREMENT_DONE_S 20
#define OSC_DIG_STAT2_IBIAS_CAP_UPDATE_DONE \
                                0x00080000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_IBIAS_CAP_UPDATE_DONE_M \
                                0x00080000
#define OSC_DIG_STAT2_IBIAS_CAP_UPDATE_DONE_S 19
#define OSC_DIG_STAT2_IDAC_DECREMENT_WITH_MEASURE_DONE \
                                0x00040000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_IDAC_DECREMENT_WITH_MEASURE_DONE_M \
                                0x00040000
#define OSC_DIG_STAT2_IDAC_DECREMENT_WITH_MEASURE_DONE_S 18
#define OSC_DIG_STAT2_IBIAS_INCREMENT_DONE \
                                0x00020000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_IBIAS_INCREMENT_DONE_M \
                                0x00020000
#define OSC_DIG_STAT2_IBIAS_INCREMENT_DONE_S 17
#define OSC_DIG_STAT2_RAMP_DOWN_TO_INIT_DONE \
                                0x00010000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_RAMP_DOWN_TO_INIT_DONE_M \
                                0x00010000
#define OSC_DIG_STAT2_RAMP_DOWN_TO_INIT_DONE_S 16
#define OSC_DIG_STAT2_RAMPSTATE_M \
                                0x0000F000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_RAMPSTATE_S 12
#define OSC_DIG_STAT2_ADCSTATE_M \
                                0x00000E00  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_ADCSTATE_S 9
#define OSC_DIG_STAT2_ADCSTATE_ADC_RESET \
                                0x00000000  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT2_ADCSTATE_ADC_IDLE \
                                0x00000200  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT2_ADCSTATE_ADC_SC \
                                0x00000400  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT2_ADCSTATE_ADC_RDDCB \
                                0x00000600  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT2_ADCSTATE_ADC_RDAMP \
                                0x00000800  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT2_ADCSTATE_ADC_CALC \
                                0x00000A00  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 
#define OSC_DIG_STAT2_ADC_COMP_P \
                                0x00000100  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_ADC_COMP_P_M \
                                0x00000100
#define OSC_DIG_STAT2_ADC_COMP_P_S 8
#define OSC_DIG_STAT2_ADC_COMP_M \
                                0x00000080  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_ADC_COMP_M_M \
                                0x00000080
#define OSC_DIG_STAT2_ADC_COMP_M_S 7
#define OSC_DIG_STAT2_AMPCOMP_OF_UF_M \
                                0x00000070  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

