ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_osc_dig.h
#define OSC_DIG_STAT2_AMPCOMP_OF_UF_S 4
#define OSC_DIG_STAT2_AMPCOMP_REQ \
                                0x00000008  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_AMPCOMP_REQ_M \
                                0x00000008
#define OSC_DIG_STAT2_AMPCOMP_REQ_S 3
#define OSC_DIG_STAT2_XOSC_HF_AMPGOOD \
                                0x00000004  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_XOSC_HF_AMPGOOD_M \
                                0x00000004
#define OSC_DIG_STAT2_XOSC_HF_AMPGOOD_S 2
#define OSC_DIG_STAT2_XOSC_HF_FREQGOOD \
                                0x00000002  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_XOSC_HF_FREQGOOD_M \
                                0x00000002
#define OSC_DIG_STAT2_XOSC_HF_FREQGOOD_S 1
#define OSC_DIG_STAT2_XOSC_HF_RF_FREQGOOD \
                                0x00000001  // Internal register. Value is 
                                            // controlled through TI provided 
                                            // API and should not be edited by 
                                            // customer. 

#define OSC_DIG_STAT2_XOSC_HF_RF_FREQGOOD_M \
                                0x00000001
#define OSC_DIG_STAT2_XOSC_HF_RF_FREQGOOD_S 0


#endif // __HW_OSC_DIG_H__

